Masmiseim36/nxpSDK/boards/mimxrt700evk/demo_apps/power_mode_with_hifi/cm33_core0/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Analog mux is disabled */
#define IOPCTL_PIO_ANAMUX_DI 0x00u
/*!
 * @brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u
/*!
 * @brief Normal drive */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u
/*!
 * @brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC0 0x00u
/*!
 * @brief Selects pin function 1 */
#define IOPCTL_PIO_FUNC1 0x01u
/*!
 * @brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_DI 0x00u
/*!
 * @brief Enables input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u
/*!
 * @brief Input function is not inverted */
#define IOPCTL_PIO_INV_DI 0x00u
/*!
 * @brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u
/*!
 * @brief Enable pull-down function */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u
/*!
 * @brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u
/*!
 * @brief Normal mode */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u
/*!
 * @brief Input Buffer Enable: Enables */
#define PMIC_I2C_SCL_IBENA_IBENA_1 0x01u
/*!
 * @brief Open-drain Mode Enable: Enables for simulated open-drain output (high drive disabled) */
#define PMIC_I2C_SCL_ODENA_ODENA_1 0x01u
/*!
 * @brief Slew Rate Control: Disables. Standard mode. */
#define PMIC_I2C_SCL_SLEWRATE_SLEWRATE_0 0x00u
/*!
 * @brief Input Buffer Enable: Enables */
#define PMIC_I2C_SDA_IBENA_IBENA_1 0x01u
/*!
 * @brief Open-drain Mode Enable: Enables for simulated open-drain output (high drive disabled) */
#define PMIC_I2C_SDA_ODENA_ODENA_1 0x01u
/*!
 * @brief Slew Rate Control: Disables, in standard mode. */
#define PMIC_I2C_SDA_SLEWRATE_SLEWRATE_0 0x00u

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
